extends Node
#
class 怪物:
	# 核心信息与状态
	var 怪物ID: String = ""
	var 数据:引擎.数据库.NPC数据库.NPC
	var 状态:引擎.生命魔法类.生命魔法 = 引擎.生命魔法类.生命魔法.new()
	var NPC技能:=引擎.数据库.NPC技能数据库.new().获取数据库()
	#var 技能:=引擎.数据库.技能数据库.new().获取数据库()
	var 数量: int = 1 #这是需要 设置的
	
	# ==============================================
	# 基础信息单独获取方法（每个属性对应一个）
	# ==============================================
	## ==============================================
	## 极简初始化：仅需传入怪物ID
	## ==============================================
	func _init(怪物ID: String, 初始数量: int = 1) -> void:
		self.怪物ID = 怪物ID
		self.数量 = 初始数量
		self.数据=引擎.数据库.NPC数据库.new().获取数据库(self.怪物ID)
		if not 数据.获取属性列表(self.怪物ID).has("生命值"):
			引擎.调试.打印("警告怪物数据库:",self.怪物ID,"未包含生命值属性")
		else:
			self.状态.设置上限生命值(float(数据.获取属性列表(self.怪物ID).生命值),true)
		if not 数据.获取属性列表(self.怪物ID).has("魔法值"):
			引擎.调试.打印("警告怪物数据库:",self.怪物ID,"未包含魔法值属性")
		else:
			self.状态.设置上限魔法值(float(数据.获取属性列表(self.怪物ID).魔法值),true)	
		
	
##
